#ifndef GOF2_AGENT_H
#define GOF2_AGENT_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct Agent {
    void* field_0xc;                    // +0xc
    void* field_0x10;                   // +0x10
    int field_0x14;                     // +0x14
    unsigned char field_0x24;           // +0x24
    unsigned char field_0x25;           // +0x25
    int field_0x28;                     // +0x28
    int field_0x2c;                     // +0x2c
    int field_0x30;                     // +0x30
    int field_0x34;                     // +0x34
    int field_0x38;                     // +0x38
    int field_0x3c;                     // +0x3c
    unsigned field_0x40;                // +0x40
    int field_0x44;                     // +0x44
    int field_0x48;                     // +0x48
    int field_0x4c;                     // +0x4c
    uint8_t field_0x50;                 // +0x50
    int field_0x54;                     // +0x54
    int field_0x58;                     // +0x58
    int field_0x5c;                     // +0x5c
    int field_0x60;                     // +0x60
    int field_0x64;                     // +0x64
    int field_0x68;                     // +0x68
    uint8_t field_0x84;                 // +0x84
    uint8_t field_0x85;                 // +0x85
    int* field_0x88;                    // +0x88
    Mission* field_0x8c;                // +0x8c
    void* field_0x90;                   // +0x90
    int field_0x94;                     // +0x94
};
#endif
