#ifndef GOF2_BOUNDINGAAB_H
#define GOF2_BOUNDINGAAB_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct BoundingAAB {
    void* field_0x0;                    // +0x0
    float field_0x8;                    // +0x8
    float field_0xc;                    // +0xc
    float field_0x10;                   // +0x10
    float field_0x14;                   // +0x14
    float field_0x18;                   // +0x18
    float field_0x1c;                   // +0x1c
    float field_0x20;                   // +0x20
    float field_0x24;                   // +0x24
    float field_0x28;                   // +0x28
};
#endif
