#ifndef GOF2_CHOICEWINDOW_H
#define GOF2_CHOICEWINDOW_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct ChoiceWindow {
    int field_0x0;                      // +0x0
    int field_0x4;                      // +0x4
    int field_0x8;                      // +0x8
    int field_0xc;                      // +0xc
    void* field_0x10;                   // +0x10
    void* field_0x14;                   // +0x14
    void* field_0x18;                   // +0x18
    void* field_0x1c;                   // +0x1c
    String field_0x20;                  // +0x20
    int field_0x2c;                     // +0x2c
    int field_0x30;                     // +0x30
    int field_0x34;                     // +0x34
    int field_0x38;                     // +0x38
    int field_0x48;                     // +0x48
    int field_0x4c;                     // +0x4c
    int field_0x50;                     // +0x50
    int field_0x54;                     // +0x54
    uint8_t field_0x58;                 // +0x58
    uint8_t field_0x59;                 // +0x59
};
#endif
