#ifndef GOF2_GLOBALS_H
#define GOF2_GLOBALS_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct Globals {
    int field_0x34;                     // +0x34
    void* field_0x3c;                   // +0x3c
    void* field_0x40;                   // +0x40
    void* field_0x48;                   // +0x48
    unsigned int* field_0x54;           // +0x54
    int field_0xac;                     // +0xac
    unsigned short field_0x110;         // +0x110
    int field_0x114;                    // +0x114
    int field_0x14c;                    // +0x14c
};
#endif
