#ifndef GOF2_OBJECTGUN_H
#define GOF2_OBJECTGUN_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct ObjectGun {
    void* field_0x0;                    // +0x0
    int field_0x4;                      // +0x4
    Gun* field_0x8;                     // +0x8
    Level* field_0xc;                   // +0xc
    uint32_t field_0x10;                // +0x10
    int field_0x14;                     // +0x14
    AEGeometry* field_0x18;             // +0x18
    uint8_t field_0x1c;                 // +0x1c
    uint8_t field_0x1d;                 // +0x1d
    uint32_t field_0x20;                // +0x20
    uint8_t field_0x24;                 // +0x24
    int field_0x28;                     // +0x28
    Array* field_0x2c;                  // +0x2c
    void* field_0x30;                   // +0x30
    int field_0x34;                     // +0x34
    float field_0x3c;                   // +0x3c
    float field_0x40;                   // +0x40
    float field_0x44;                   // +0x44
    float field_0x48;                   // +0x48
    uint8_t field_0x4c;                 // +0x4c
    Vec4 field_0x50;                    // +0x50
    uint32_t field_0x54;                // +0x54
    uint32_t field_0x58;                // +0x58
    uint32_t field_0x5c;                // +0x5c
    Vec4 field_0x60;                    // +0x60
    uint32_t field_0x64;                // +0x64
    uint32_t field_0x68;                // +0x68
    uint32_t field_0x6c;                // +0x6c
    uint32_t field_0x70;                // +0x70
    uint32_t field_0x74;                // +0x74
    uint32_t field_0x78;                // +0x78
    float field_0x7c;                   // +0x7c
    uint32_t field_0x84;                // +0x84
    uint32_t field_0x88;                // +0x88
    float field_0x8c;                   // +0x8c
    uint32_t field_0x94;                // +0x94
    uint32_t field_0x98;                // +0x98
    float field_0x9c;                   // +0x9c
};
#endif
