#ifndef GOF2_PAINTCANVAS_H
#define GOF2_PAINTCANVAS_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct PaintCanvas {
    int field_0x4;                      // +0x4
    char* field_0x8;                    // +0x8
    int field_0xc;                      // +0xc
    unsigned int field_0x10;            // +0x10
    char** field_0x14;                  // +0x14
    int field_0x20;                     // +0x20
    unsigned int field_0x24;            // +0x24
    char** field_0x28;                  // +0x28
    int field_0x30;                     // +0x30
    void* field_0x34;                   // +0x34
    unsigned int field_0x134;           // +0x134
    char** field_0x138;                 // +0x138
    unsigned int field_0x140;           // +0x140
    void** field_0x144;                 // +0x144
    unsigned int field_0x14c;           // +0x14c
    char** field_0x150;                 // +0x150
    unsigned int field_0x158;           // +0x158
    char** field_0x15c;                 // +0x15c
    unsigned int field_0x164;           // +0x164
    void** field_0x168;                 // +0x168
    unsigned int field_0x170;           // +0x170
    unsigned int field_0x174;           // +0x174
    void** field_0x178;                 // +0x178
    unsigned int field_0x180;           // +0x180
    char** field_0x184;                 // +0x184
    char* field_0x1c8;                  // +0x1c8
    unsigned char field_0x1f0;          // +0x1f0
    char field_0x1f1;                   // +0x1f1
    int field_0x1f4;                    // +0x1f4
    float field_0x1fc;                  // +0x1fc
    float field_0x200;                  // +0x200
    float field_0x204;                  // +0x204
    float field_0x208;                  // +0x208
};
#endif
