#ifndef GOF2_PLAYERJUMPGATE_H
#define GOF2_PLAYERJUMPGATE_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct PlayerJumpgate {
    void* field_0x0;                    // +0x0
    void* field_0x4;                    // +0x4
    void* field_0x8;                    // +0x8
    uint8_t field_0xf5;                 // +0xf5
    int32_t field_0x124;                // +0x124
    int32_t field_0x128;                // +0x128
    int32_t field_0x12c;                // +0x12c
    uint8_t field_0x140;                // +0x140
    uint32_t field_0x144;               // +0x144
};
#endif
