#ifndef GOF2_PLAYERGASCLOUD_H
#define GOF2_PLAYERGASCLOUD_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct PlayerGasCloud {
    void* field_0x4;                    // +0x4
    void* field_0x8;                    // +0x8
    uint8_t field_0x25;                 // +0x25
    uint8_t field_0x44;                 // +0x44
    uint8_t field_0x4c;                 // +0x4c
    int field_0x78;                     // +0x78
    int field_0x88;                     // +0x88
    uint8_t field_0xf5;                 // +0xf5
    float field_0x128;                  // +0x128
    float field_0x12c;                  // +0x12c
    float field_0x130;                  // +0x130
    void* field_0x134;                  // +0x134
    void* field_0x138;                  // +0x138
    void* field_0x13c;                  // +0x13c
    void* field_0x140;                  // +0x140
    void* field_0x144;                  // +0x144
    v4i1 field_0x145;                   // +0x145
    void* field_0x148;                  // +0x148
    void* field_0x14c;                  // +0x14c
    void* field_0x150;                  // +0x150
    uint8_t field_0x154;                // +0x154
    int field_0x158;                    // +0x158
    uint8_t field_0x15c;                // +0x15c
    int field_0x160;                    // +0x160
    uint16_t field_0x164;               // +0x164
    int field_0x168;                    // +0x168
};
#endif
