#ifndef GOF2_PLAYERWORMHOLE_H
#define GOF2_PLAYERWORMHOLE_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct PlayerWormHole {
    char* field_0x0;                    // +0x0
    void* field_0x4;                    // +0x4
    void* field_0x8;                    // +0x8
    float field_0x58;                   // +0x58
    float field_0x5c;                   // +0x5c
    float field_0x60;                   // +0x60
    uint8_t field_0xf5;                 // +0xf5
    int field_0x124;                    // +0x124
    int field_0x128;                    // +0x128
    int field_0x12c;                    // +0x12c
    int field_0x150;                    // +0x150
    int field_0x154;                    // +0x154
    uint8_t field_0x15c;                // +0x15c
};
#endif
