#ifndef GOF2_REPAIRBEAM_H
#define GOF2_REPAIRBEAM_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct RepairBeam {
    int field_0x0;                      // +0x0
    int field_0x4;                      // +0x4
    int field_0x8;                      // +0x8
    int field_0xc;                      // +0xc
    void* field_0x10;                   // +0x10
    void* field_0x14;                   // +0x14
    void* field_0x18;                   // +0x18
    int field_0x1c;                     // +0x1c
    int field_0x20;                     // +0x20
};
#endif
