#ifndef GOF2_SPARKS_H
#define GOF2_SPARKS_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct Sparks {
    int* field_0x0;                     // +0x0
    uint32_t field_0x4;                 // +0x4
    uint32_t field_0x8;                 // +0x8
    int field_0xc;                      // +0xc
    uint8_t field_0x10;                 // +0x10
    int field_0x14;                     // +0x14
    uint32_t field_0x18;                // +0x18
    int field_0x1c;                     // +0x1c
    int field_0x20;                     // +0x20
};
#endif
