#ifndef GOF2_WANTEDWINDOW_H
#define GOF2_WANTEDWINDOW_H
#include "gof2/common.h"
// struct derived from offset-access field map (deterministic field_0xNN naming)
struct WantedWindow {
    uint32_t field_0x0;                 // +0x0
    void* field_0x4;                    // +0x4
    void* field_0x8;                    // +0x8
    void* field_0xc;                    // +0xc
    int field_0x10;                     // +0x10
    uint8_t field_0x14;                 // +0x14
    uint8_t field_0x15;                 // +0x15
    void* field_0x18;                   // +0x18
    int field_0x1c;                     // +0x1c
    int field_0x20;                     // +0x20
    int field_0x24;                     // +0x24
    int field_0x28;                     // +0x28
    void* field_0x2c;                   // +0x2c
    uint32_t field_0x30;                // +0x30
    uint32_t field_0x34;                // +0x34
    void* field_0x38;                   // +0x38
    int field_0x84;                     // +0x84
    int field_0x88;                     // +0x88
    int field_0x8c;                     // +0x8c
    int field_0x90;                     // +0x90
    v4si field_0x91;                    // +0x91
    float field_0x94;                   // +0x94
    float field_0x98;                   // +0x98
    int field_0x9c;                     // +0x9c
    uint8_t field_0xa0;                 // +0xa0
    int field_0xa4;                     // +0xa4
    int field_0xa8;                     // +0xa8
    int field_0xac;                     // +0xac
    void* field_0xb0;                   // +0xb0
};
#endif
